import os
# Задел под парсинг при исправленных файлах
directory = 'courses-description'
addressess = {'Барклая 15,3', 'Береговой пр-д 1Б', 'Новозаводская д.1', 'Филевский б-р 23-2', 'Барклая 15-3', 'Новозаводская д.19', 'Новозаводская 1', 'Физкультурный п-д д 8', 'Новозаводская,19', 'Филёвский б-р д3 к 2', 'Барклая 5-5', 'Б.Филёвская 15', 'Барклая д.15 к.3', 'Физкультурный пр-д 8', 'Филевский б-р 3-2, Филёвский б-р д.13-2', 'Филевский б-р 17А', 'Б.Филевская 15', 'Филевский б-р д.3 к.2', 'Филевский бульвар 17А', 'Филевский б-р 1-2', 'Новозаводская, 19', 'Филевский б-р,23-2', 'Новозаводская 19', 'О.Дундича 5', 'Барклая д. 15 к.3', '- Береговой пр-д 1Б', 'О. Дундича 5', 'Тучковская 5', 'Тучковская, д.5', 'Большая Филевская 15', 'Береговой пр 1б', 'О. Дундича 5 ', 'Б.Филевская,15', 'Большая Филевская,15', 'ул. Тучковская д.5', 'Филевский б-р 13-2', 'Береговой пр-д 1Б)', 'ул.Барклая д.15 к.3', 'Б.Филевсая 15', 'Б.Филевская, 15', 'Филёвский б-р д.3 к.2', 'Филевский б-р 8-2', 'Филевский б 17А', 'Филёвский б-р д.13 к.2', 'Филевский б 3-2', 'Филевский б-р 3-2', 'Олеко Дундича д.5', 'Физкультурный пр-д,8', 'Филевский б-р,8-2', 'Б.Филевская д.15', 'Филёвский б-р д.13 к.2 '}
for filename in os.listdir(directory):
    f = os.path.join(directory, filename)
    if os.path.isfile(f):
        name_of_file = f.split('\\')[-1]
        type_of_activity = name_of_file[name_of_file.index('-') + 1:name_of_file.index('.')]
        data = [elem.strip().split('\t') for elem in open(f, 'r', encoding="utf8").readlines()[1::]]
        for info in data:
            info_for_course = info[1]
            age_limit = info[4]
            cost = info_for_course[info_for_course.rfind('(') + 1: info_for_course.rfind(')')]
            info_for_course = info_for_course[:info_for_course.rfind('(')].strip()
            address = info_for_course[info_for_course.rfind('(') + 1:info_for_course.rfind(')')]
            if ' - ' in address:
                addressess.add(address.split(' - ')[-1])
print(len(addressess))
